#Employee information

In [8]:
import pandas as pd
import numpy as np

In [ ]:
max=Data['salary'].max()
print("the maxumum salary is ",max)

the maxumum salary is  99000

In [ ]:
#Name of column
Namecolumn=list(Data.columns)
print(Namecolumn)

['employee', 'gender', 'salary', 'department', 'country']

#Minimum salary

In [ ]:
Min=Data['salary'].min()
Min

32000

In [ ]:
# Name employee from USA
USa=Data[Data['country'].isin(['USA'])]
USa

       employee  gender  salary department country
0       Foo Bar    Male   40000    Finance     USA
3   Chris Brown    Male   54000      Legal     USA
4         Drake    Male   72000         IT     USA
11          Ava  Female   48000         HR     USA
12      Beyonce  Female   35000         HR     USA

In [ ]:
IT=Data[Data['country'].isin(['USA']) & Data['department'].isin(['IT','HR'])]
IT

   employee  gender  salary department country
4     Drake    Male   72000         IT     USA
11      Ava  Female   48000         HR     USA
12  Beyonce  Female   35000         HR     USA

In [ ]:
#female employee in IT and HR
Female=Data[Data['gender'].isin(['Female']) & Data['department'].isin(['HR','IT'])]
Female

   employee  gender  salary department country
11      Ava  Female   48000         HR     USA
12  Beyonce  Female   35000         HR     USA

In [ ]:
# selecting employee who have more than 40000

Salary=Data[Data['country'].isin(['USA']) & Data['department'].isin(['IT','HR'])]
Salary.loc[Data['salary']> 40000]

   employee  gender  salary department country
4     Drake    Male   72000         IT     USA
11      Ava  Female   48000         HR     USA

In [ ]:
#showing unique country
Data['country'].unique()

array(['USA', 'Brazil', 'Italy', 'Tanzania', 'Kenya', 'Uganda', 'Spain'],
      dtype=object)

In [ ]:
# grouping or numner of emplyee in each coutry
Data.groupby(['country']).count()

          employee  gender  salary  department
country
Brazil           2       2       2           2
Italy            1       1       1           1
Kenya            1       1       1           1
Spain            2       2       2           2
Tanzania         1       1       1           1
USA              5       5       5           5
Uganda           1       1       1           1

In [ ]:
#group by dept
Data.groupby(['department']).count()

                employee  gender  salary  country
department
Administration         1       1       1        1
Finance                2       2       2        2
HR                     2       2       2        2
IT                     4       4       4        4
Legal                  2       2       2        2
Marketing              1       1       1        1
Security               1       1       1        1

In [7]:
Data.head(3)

NameError: name 'Data' is not defined